Ran Apply for dir: `dev` workspace: `default`

**Apply Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt run --all apply --non-interactive -no-color' in '/home/atlantis/.atlantis/repos/suryansh112/terragrunt/6/default/dev': exit status 1: running "terragrunt run --all apply --non-interactive -no-color" in "/home/atlantis/.atlantis/repos/suryansh112/terragrunt/6/default/dev": 
08:27:01.081 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.14.3` instead.
08:27:01.124 INFO   Unit queue will be processed for apply in this order:
- Unit env/dev/vpc
- Unit env/dev/load-balancer
- Unit env/dev/ec2

08:27:01.131 INFO   [env/dev/vpc] Downloading Terraform configurations from ./modules/vpc into ./env/dev/vpc/.terragrunt-cache/1Hzr5YObEtyI2lqsyupnu-0ozVA/5yKHsJOCfqHZaOBmSCc5tSLa6MM
08:27:01.161 INFO   [env/dev/vpc] terraform1.14.3: Initializing the backend...
08:27:01.262 INFO   [env/dev/vpc] terraform1.14.3: Successfully configured the backend "s3"! Terraform will automatically
08:27:01.262 INFO   [env/dev/vpc] terraform1.14.3: use this backend unless the backend configuration changes.
08:27:01.323 INFO   [env/dev/vpc] terraform1.14.3: Initializing provider plugins...
08:27:01.323 INFO   [env/dev/vpc] terraform1.14.3: - Reusing previous version of hashicorp/aws from the dependency lock file
08:27:01.401 INFO   [env/dev/vpc] terraform1.14.3: - Installing hashicorp/aws v6.36.0...
08:27:15.635 INFO   [env/dev/vpc] terraform1.14.3: - Installed hashicorp/aws v6.36.0 (signed by HashiCorp)
08:27:15.635 INFO   [env/dev/vpc] terraform1.14.3: Terraform has made some changes to the provider dependency selections recorded
08:27:15.635 INFO   [env/dev/vpc] terraform1.14.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
08:27:15.635 INFO   [env/dev/vpc] terraform1.14.3: version control system if they represent changes you intended to make.
08:27:15.635 INFO   [env/dev/vpc] terraform1.14.3: Terraform has been successfully initialized!
08:27:21.760 STDOUT [env/dev/vpc] terraform1.14.3: Terraform used the selected providers to generate the following execution
08:27:21.760 STDOUT [env/dev/vpc] terraform1.14.3: plan. Resource actions are indicated with the following symbols:
08:27:21.760 STDOUT [env/dev/vpc] terraform1.14.3:   + create
08:27:21.760 STDOUT [env/dev/vpc] terraform1.14.3: Terraform will perform the following actions:
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_eip.nat[0] will be created
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_eip" "nat" {
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + allocation_id        = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + arn                  = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + association_id       = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + carrier_ip           = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + customer_owned_ip    = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + domain               = "vpc"
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + id                   = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + instance             = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + ipam_pool_id         = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + network_border_group = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + network_interface    = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + private_dns          = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + private_ip           = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + ptr_record           = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + public_dns           = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + public_ip            = (known after apply)
08:27:21.761 STDOUT [env/dev/vpc] terraform1.14.3:       + public_ipv4_pool     = (known after apply)
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:       + region               = "us-east-1"
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                 = {
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc-nat-eip"
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all             = {
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc-nat-eip"
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_internet_gateway.igw will be created
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_internet_gateway" "igw" {
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:       + arn      = (known after apply)
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:       + id       = (known after apply)
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id = (known after apply)
08:27:21.762 STDOUT [env/dev/vpc] terraform1.14.3:       + region   = "us-east-1"
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:       + tags     = {
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-igw"
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all = {
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-igw"
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id   = (known after apply)
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_nat_gateway.ngw[0] will be created
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_nat_gateway" "ngw" {
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:       + allocation_id                      = (known after apply)
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:       + association_id                     = (known after apply)
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:       + auto_provision_zones               = (known after apply)
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:       + auto_scaling_ips                   = (known after apply)
08:27:21.763 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_mode                  = (known after apply)
08:27:21.764 STDOUT [env/dev/vpc] terraform1.14.3:       + connectivity_type                  = "public"
08:27:21.764 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                 = (known after apply)
08:27:21.764 STDOUT [env/dev/vpc] terraform1.14.3:       + network_interface_id               = (known after apply)
08:27:21.764 STDOUT [env/dev/vpc] terraform1.14.3:       + private_ip                         = (known after apply)
08:27:21.764 STDOUT [env/dev/vpc] terraform1.14.3:       + public_ip                          = (known after apply)
08:27:21.764 STDOUT [env/dev/vpc] terraform1.14.3:       + region                             = "us-east-1"
08:27:21.764 STDOUT [env/dev/vpc] terraform1.14.3:       + regional_nat_gateway_address       = (known after apply)
08:27:21.765 STDOUT [env/dev/vpc] terraform1.14.3:       + regional_nat_gateway_auto_mode     = (known after apply)
08:27:21.765 STDOUT [env/dev/vpc] terraform1.14.3:       + route_table_id                     = (known after apply)
08:27:21.766 STDOUT [env/dev/vpc] terraform1.14.3:       + secondary_allocation_ids           = (known after apply)
08:27:21.766 STDOUT [env/dev/vpc] terraform1.14.3:       + secondary_private_ip_address_count = (known after apply)
08:27:21.766 STDOUT [env/dev/vpc] terraform1.14.3:       + secondary_private_ip_addresses     = (known after apply)
08:27:21.766 STDOUT [env/dev/vpc] terraform1.14.3:       + subnet_id                          = (known after apply)
08:27:21.766 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                               = {
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-ngw"
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                           = {
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-ngw"
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id                             = (known after apply)
08:27:21.767 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.768 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_route_table.private_rtb[0] will be created
08:27:21.768 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_route_table" "private_rtb" {
08:27:21.768 STDOUT [env/dev/vpc] terraform1.14.3:       + arn              = (known after apply)
08:27:21.768 STDOUT [env/dev/vpc] terraform1.14.3:       + id               = (known after apply)
08:27:21.768 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id         = (known after apply)
08:27:21.768 STDOUT [env/dev/vpc] terraform1.14.3:       + propagating_vgws = (known after apply)
08:27:21.768 STDOUT [env/dev/vpc] terraform1.14.3:       + region           = "us-east-1"
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:       + route            = [
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:           + {
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:               + cidr_block                 = "0.0.0.0/0"
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:               + gateway_id                 = (known after apply)
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:                 # (11 unchanged attributes hidden)
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:             },
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:         ]
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:       + tags             = {
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc-private-rtb"
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all         = {
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc-private-rtb"
08:27:21.769 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id           = (known after apply)
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_route_table.public_rtb will be created
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_route_table" "public_rtb" {
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:       + arn              = (known after apply)
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:       + id               = (known after apply)
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id         = (known after apply)
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:       + propagating_vgws = (known after apply)
08:27:21.775 STDOUT [env/dev/vpc] terraform1.14.3:       + region           = "us-east-1"
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:       + route            = [
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:           + {
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:               + cidr_block                 = "0.0.0.0/0"
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:               + gateway_id                 = (known after apply)
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:                 # (11 unchanged attributes hidden)
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:             },
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:         ]
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:       + tags             = {
08:27:21.776 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc-public-rtb"
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all         = {
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc-public-rtb"
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id           = (known after apply)
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_route_table_association.private_rtb_association[0] will be created
08:27:21.777 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_route_table_association" "private_rtb_association" {
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:       + id             = (known after apply)
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:       + region         = "us-east-1"
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:       + route_table_id = (known after apply)
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:       + subnet_id      = (known after apply)
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_route_table_association.private_rtb_association[1] will be created
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_route_table_association" "private_rtb_association" {
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:       + id             = (known after apply)
08:27:21.778 STDOUT [env/dev/vpc] terraform1.14.3:       + region         = "us-east-1"
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:       + route_table_id = (known after apply)
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:       + subnet_id      = (known after apply)
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_route_table_association.private_rtb_association[2] will be created
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_route_table_association" "private_rtb_association" {
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:       + id             = (known after apply)
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:       + region         = "us-east-1"
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:       + route_table_id = (known after apply)
08:27:21.779 STDOUT [env/dev/vpc] terraform1.14.3:       + subnet_id      = (known after apply)
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_route_table_association.public_rtb_association[0] will be created
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_route_table_association" "public_rtb_association" {
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:       + id             = (known after apply)
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:       + region         = "us-east-1"
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:       + route_table_id = (known after apply)
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:       + subnet_id      = (known after apply)
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.780 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_route_table_association.public_rtb_association[1] will be created
08:27:21.781 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_route_table_association" "public_rtb_association" {
08:27:21.781 STDOUT [env/dev/vpc] terraform1.14.3:       + id             = (known after apply)
08:27:21.781 STDOUT [env/dev/vpc] terraform1.14.3:       + region         = "us-east-1"
08:27:21.781 STDOUT [env/dev/vpc] terraform1.14.3:       + route_table_id = (known after apply)
08:27:21.781 STDOUT [env/dev/vpc] terraform1.14.3:       + subnet_id      = (known after apply)
08:27:21.781 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.781 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_route_table_association.public_rtb_association[2] will be created
08:27:21.781 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_route_table_association" "public_rtb_association" {
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:       + id             = (known after apply)
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:       + region         = "us-east-1"
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:       + route_table_id = (known after apply)
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:       + subnet_id      = (known after apply)
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_subnet.private_subnet[0] will be created
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_subnet" "private_subnet" {
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:       + arn                                            = (known after apply)
08:27:21.782 STDOUT [env/dev/vpc] terraform1.14.3:       + assign_ipv6_address_on_creation                = false
08:27:21.783 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone                              = "us-east-1a"
08:27:21.783 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone_id                           = (known after apply)
08:27:21.783 STDOUT [env/dev/vpc] terraform1.14.3:       + cidr_block                                     = "10.0.4.0/24"
08:27:21.783 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns64                                   = false
08:27:21.783 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_a_record_on_launch    = false
08:27:21.783 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:27:21.783 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                             = (known after apply)
08:27:21.784 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block                                = (known after apply)
08:27:21.784 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block_association_id                 = (known after apply)
08:27:21.784 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_native                                    = false
08:27:21.784 STDOUT [env/dev/vpc] terraform1.14.3:       + map_public_ip_on_launch                        = false
08:27:21.784 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id                                       = (known after apply)
08:27:21.785 STDOUT [env/dev/vpc] terraform1.14.3:       + private_dns_hostname_type_on_launch            = (known after apply)
08:27:21.785 STDOUT [env/dev/vpc] terraform1.14.3:       + region                                         = "us-east-1"
08:27:21.785 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                                           = {
08:27:21.785 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Private-Subnet--dev-1"
08:27:21.785 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                                       = {
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Private-Subnet--dev-1"
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id                                         = (known after apply)
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_subnet.private_subnet[1] will be created
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_subnet" "private_subnet" {
08:27:21.786 STDOUT [env/dev/vpc] terraform1.14.3:       + arn                                            = (known after apply)
08:27:21.787 STDOUT [env/dev/vpc] terraform1.14.3:       + assign_ipv6_address_on_creation                = false
08:27:21.787 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone                              = "us-east-1b"
08:27:21.787 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone_id                           = (known after apply)
08:27:21.787 STDOUT [env/dev/vpc] terraform1.14.3:       + cidr_block                                     = "10.0.5.0/24"
08:27:21.787 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns64                                   = false
08:27:21.787 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_a_record_on_launch    = false
08:27:21.787 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:27:21.787 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                             = (known after apply)
08:27:21.788 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block                                = (known after apply)
08:27:21.788 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block_association_id                 = (known after apply)
08:27:21.788 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_native                                    = false
08:27:21.788 STDOUT [env/dev/vpc] terraform1.14.3:       + map_public_ip_on_launch                        = false
08:27:21.788 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id                                       = (known after apply)
08:27:21.788 STDOUT [env/dev/vpc] terraform1.14.3:       + private_dns_hostname_type_on_launch            = (known after apply)
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:       + region                                         = "us-east-1"
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                                           = {
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Private-Subnet--dev-2"
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                                       = {
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Private-Subnet--dev-2"
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.789 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id                                         = (known after apply)
08:27:21.790 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.790 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_subnet.private_subnet[2] will be created
08:27:21.790 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_subnet" "private_subnet" {
08:27:21.790 STDOUT [env/dev/vpc] terraform1.14.3:       + arn                                            = (known after apply)
08:27:21.790 STDOUT [env/dev/vpc] terraform1.14.3:       + assign_ipv6_address_on_creation                = false
08:27:21.790 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone                              = "us-east-1c"
08:27:21.790 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone_id                           = (known after apply)
08:27:21.791 STDOUT [env/dev/vpc] terraform1.14.3:       + cidr_block                                     = "10.0.6.0/24"
08:27:21.791 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns64                                   = false
08:27:21.791 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_a_record_on_launch    = false
08:27:21.791 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:27:21.791 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                             = (known after apply)
08:27:21.791 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block                                = (known after apply)
08:27:21.791 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block_association_id                 = (known after apply)
08:27:21.792 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_native                                    = false
08:27:21.792 STDOUT [env/dev/vpc] terraform1.14.3:       + map_public_ip_on_launch                        = false
08:27:21.792 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id                                       = (known after apply)
08:27:21.792 STDOUT [env/dev/vpc] terraform1.14.3:       + private_dns_hostname_type_on_launch            = (known after apply)
08:27:21.792 STDOUT [env/dev/vpc] terraform1.14.3:       + region                                         = "us-east-1"
08:27:21.792 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                                           = {
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Private-Subnet--dev-3"
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                                       = {
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Private-Subnet--dev-3"
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id                                         = (known after apply)
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_subnet.public_subnet[0] will be created
08:27:21.793 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_subnet" "public_subnet" {
08:27:21.794 STDOUT [env/dev/vpc] terraform1.14.3:       + arn                                            = (known after apply)
08:27:21.794 STDOUT [env/dev/vpc] terraform1.14.3:       + assign_ipv6_address_on_creation                = false
08:27:21.794 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone                              = "us-east-1a"
08:27:21.794 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone_id                           = (known after apply)
08:27:21.794 STDOUT [env/dev/vpc] terraform1.14.3:       + cidr_block                                     = "10.0.1.0/24"
08:27:21.794 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns64                                   = false
08:27:21.794 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_a_record_on_launch    = false
08:27:21.795 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:27:21.795 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                             = (known after apply)
08:27:21.795 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block                                = (known after apply)
08:27:21.795 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block_association_id                 = (known after apply)
08:27:21.795 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_native                                    = false
08:27:21.795 STDOUT [env/dev/vpc] terraform1.14.3:       + map_public_ip_on_launch                        = false
08:27:21.795 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id                                       = (known after apply)
08:27:21.795 STDOUT [env/dev/vpc] terraform1.14.3:       + private_dns_hostname_type_on_launch            = (known after apply)
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:       + region                                         = "us-east-1"
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                                           = {
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Public-Subnet--dev-1"
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                                       = {
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Public-Subnet--dev-1"
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.796 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id                                         = (known after apply)
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_subnet.public_subnet[1] will be created
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_subnet" "public_subnet" {
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:       + arn                                            = (known after apply)
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:       + assign_ipv6_address_on_creation                = false
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone                              = "us-east-1b"
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone_id                           = (known after apply)
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:       + cidr_block                                     = "10.0.2.0/24"
08:27:21.797 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns64                                   = false
08:27:21.798 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_a_record_on_launch    = false
08:27:21.798 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:27:21.798 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                             = (known after apply)
08:27:21.798 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block                                = (known after apply)
08:27:21.798 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block_association_id                 = (known after apply)
08:27:21.798 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_native                                    = false
08:27:21.798 STDOUT [env/dev/vpc] terraform1.14.3:       + map_public_ip_on_launch                        = false
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id                                       = (known after apply)
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:       + private_dns_hostname_type_on_launch            = (known after apply)
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:       + region                                         = "us-east-1"
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                                           = {
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Public-Subnet--dev-2"
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                                       = {
08:27:21.799 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Public-Subnet--dev-2"
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id                                         = (known after apply)
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_subnet.public_subnet[2] will be created
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_subnet" "public_subnet" {
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:       + arn                                            = (known after apply)
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:       + assign_ipv6_address_on_creation                = false
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone                              = "us-east-1c"
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:       + availability_zone_id                           = (known after apply)
08:27:21.800 STDOUT [env/dev/vpc] terraform1.14.3:       + cidr_block                                     = "10.0.3.0/24"
08:27:21.801 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns64                                   = false
08:27:21.801 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_a_record_on_launch    = false
08:27:21.801 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_resource_name_dns_aaaa_record_on_launch = false
08:27:21.801 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                             = (known after apply)
08:27:21.801 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block                                = (known after apply)
08:27:21.801 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block_association_id                 = (known after apply)
08:27:21.801 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_native                                    = false
08:27:21.801 STDOUT [env/dev/vpc] terraform1.14.3:       + map_public_ip_on_launch                        = false
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id                                       = (known after apply)
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:       + private_dns_hostname_type_on_launch            = (known after apply)
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:       + region                                         = "us-east-1"
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                                           = {
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Public-Subnet--dev-3"
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                                       = {
08:27:21.802 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "Public-Subnet--dev-3"
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + vpc_id                                         = (known after apply)
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:   # aws_vpc.main will be created
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:   + resource "aws_vpc" "main" {
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + arn                                  = (known after apply)
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + cidr_block                           = "10.0.0.0/16"
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + default_network_acl_id               = (known after apply)
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + default_route_table_id               = (known after apply)
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + default_security_group_id            = (known after apply)
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + dhcp_options_id                      = (known after apply)
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns_hostnames                 = true
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns_support                   = true
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_network_address_usage_metrics = (known after apply)
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                   = (known after apply)
08:27:21.803 STDOUT [env/dev/vpc] terraform1.14.3:       + instance_tenancy                     = "default"
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_association_id                  = (known after apply)
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block                      = (known after apply)
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block_network_border_group = (known after apply)
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:       + main_route_table_id                  = (known after apply)
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id                             = (known after apply)
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:       + region                               = "us-east-1"
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                                 = {
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc"
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                             = {
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc"
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3: Plan: 18 to add, 0 to change, 0 to destroy.
08:27:21.804 STDOUT [env/dev/vpc] terraform1.14.3: Changes to Outputs:
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:   + aws_vpc_id         = (known after apply)
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:   + private_subnet_ids = [
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:     ]
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:   + public_subnet_ids  = [
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:27:21.805 STDOUT [env/dev/vpc] terraform1.14.3:     ]
08:27:22.370 STDOUT [env/dev/vpc] terraform1.14.3: aws_eip.nat[0]: Creating...
08:27:22.371 STDOUT [env/dev/vpc] terraform1.14.3: aws_vpc.main: Creating...
08:27:22.561 STDERR [env/dev/vpc] terraform1.14.3: Error: creating EC2 VPC: operation error EC2: CreateVpc, https response error StatusCode: 403, RequestID: e792a1c0-d30d-42a1-8a90-bafed358d0ed, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995242251522954 is not authorized to perform: ec2:CreateVpc on resource: arn:aws:ec2:us-east-1:730335384723:vpc/* because no identity-based policy allows the ec2:CreateVpc action. Encoded authorization failure message: szSSngra2Ph_eu1tB_v3JeuO0cxa0SO2wKgHyDY9E7TmhPL2ci65via3HRex14MytovYWjIq3YMEtDsKEEpX8RfBVyEJ7BW3cLqF7ogHLkDfiVC3w8Cqs24pm74S50Ws3YYBVw_DUEduUnddFKXdkYzBChYl6Iy1VBuO97Yn1cLQaL8rtfjEeIUTCNa243WDL6CMHiulvrpIGo_zBwzdx92IaHWUQt_ilaP1uFatzkIJUrDdw3qEy9jWnnndzVokj1eTPzt0lBJVXlAXrxDcs_WFLIyprc9QQ_z6gOCexb5BZz2gZkFea2eYDSKcS6bjHJg6oBy3XBT_UW3YZZKrr85Td4l_CiNfZMGVTl3U5atrm5NHOdabuYIged6WMNbfpFyLfGMfKmRnsshQ23LC1n16COz8b1RKfpPort9r_Kaq1UrbLeaknbIXa02AsDk17C8xqN-Qb8yYK04GSXbyhFxzX0Eg35G1VQDwl61eVgcvc4HDRzE13iZTMg3eK7vxDyw3R08j8bJrMRYbjN2t_FboKoDCtln_nph40fpoH-91S18vxgOMPu4iMuKo9A
08:27:22.562 STDERR [env/dev/vpc] terraform1.14.3:   with aws_vpc.main,
08:27:22.562 STDERR [env/dev/vpc] terraform1.14.3:   on vpc.tf line 1, in resource "aws_vpc" "main":
08:27:22.562 STDERR [env/dev/vpc] terraform1.14.3:    1: resource "aws_vpc" "main" {
08:27:22.562 STDERR [env/dev/vpc] terraform1.14.3: Error: creating EC2 EIP: operation error EC2: AllocateAddress, https response error StatusCode: 403, RequestID: 5e2e73b0-02bc-40f8-99ee-53166fe23c1f, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995242251522954 is not authorized to perform: ec2:AllocateAddress on resource: arn:aws:ec2:us-east-1:730335384723:elastic-ip/* because no identity-based policy allows the ec2:AllocateAddress action. Encoded authorization failure message: d6K2sRfYyxejbTF9U3oYJIej2WY6WKNaLoP-YknJhh93koKd2PGCkAhS49zpH2F2cdADGajyw3YyK-YqmkGXEuemEoJtSunS9FBwyESQmskTSIwLwgs3vylCmfpqdmpvvHyUADPw6M5UtdGTxdDv9yH1dLgpwSyJWeRR57_FastZCCSAixhkAUxjS_NYvXMideXvOKpt3gICe3w3GX7JqQ2zKMnPnI-x37IbvSyNQtTBN9vkEwMgN1Snw02Tb-jPpg-eQ-HETNgouvIJlRP1KDwW4-_Wg_E9lbczhu-dwecH0pC6UajtZtrxfPsUuvBzYvn_0Nwc1uBKjzBF69NcVa9b1SCcRNSLMsQdBZr1NOvurPQ_fXJh_7MvGQphWxYWa4CD18-Uh2XZglJsX1b-sK1yFJ7q0BWagThUa81c3CDbwsBGr0cndZljx6XTkgmERcQJvRXIh2bjeB630P9JAxnpqfqeBzf57nQW-mm4rFtWbGSt0Z3Xh4Skf5z0JgFvUXR20G0R8uSDRknT7XxSCM_yjnAGN36kdCkRwwfhNW0JxU8
08:27:22.564 STDERR [env/dev/vpc] terraform1.14.3:   with aws_eip.nat[0],
08:27:22.564 STDERR [env/dev/vpc] terraform1.14.3:   on vpc.tf line 49, in resource "aws_eip" "nat":
08:27:22.564 STDERR [env/dev/vpc] terraform1.14.3:   49: resource "aws_eip" "nat" {
08:27:22.581 ERROR  Run failed: 3 errors occurred:

* Unit './env/dev/load-balancer' did not run due to a failure in './env/dev/vpc'

* Unit './env/dev/ec2' did not run due to a failure in './env/dev/vpc'

* Failed to execute "terraform1.14.3 apply -no-color -input=false -auto-approve" in ./env/dev/vpc/.terragrunt-cache/1Hzr5YObEtyI2lqsyupnu-0ozVA/5yKHsJOCfqHZaOBmSCc5tSLa6MM
  
  Error: creating EC2 VPC: operation error EC2: CreateVpc, https response error StatusCode: 403, RequestID: e792a1c0-d30d-42a1-8a90-bafed358d0ed, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995242251522954 is not authorized to perform: ec2:CreateVpc on resource: arn:aws:ec2:us-east-1:730335384723:vpc/* because no identity-based policy allows the ec2:CreateVpc action. Encoded authorization failure message: szSSngra2Ph_eu1tB_v3JeuO0cxa0SO2wKgHyDY9E7TmhPL2ci65via3HRex14MytovYWjIq3YMEtDsKEEpX8RfBVyEJ7BW3cLqF7ogHLkDfiVC3w8Cqs24pm74S50Ws3YYBVw_DUEduUnddFKXdkYzBChYl6Iy1VBuO97Yn1cLQaL8rtfjEeIUTCNa243WDL6CMHiulvrpIGo_zBwzdx92IaHWUQt_ilaP1uFatzkIJUrDdw3qEy9jWnnndzVokj1eTPzt0lBJVXlAXrxDcs_WFLIyprc9QQ_z6gOCexb5BZz2gZkFea2eYDSKcS6bjHJg6oBy3XBT_UW3YZZKrr85Td4l_CiNfZMGVTl3U5atrm5NHOdabuYIged6WMNbfpFyLfGMfKmRnsshQ23LC1n16COz8b1RKfpPort9r_Kaq1UrbLeaknbIXa02AsDk17C8xqN-Qb8yYK04GSXbyhFxzX0Eg35G1VQDwl61eVgcvc4HDRzE13iZTMg3eK7vxDyw3R08j8bJrMRYbjN2t_FboKoDCtln_nph40fpoH-91S18vxgOMPu4iMuKo9A
  
    with aws_vpc.main,
    on vpc.tf line 1, in resource "aws_vpc" "main":
     1: resource "aws_vpc" "main" {
  
  
  Error: creating EC2 EIP: operation error EC2: AllocateAddress, https response error StatusCode: 403, RequestID: 5e2e73b0-02bc-40f8-99ee-53166fe23c1f, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995242251522954 is not authorized to perform: ec2:AllocateAddress on resource: arn:aws:ec2:us-east-1:730335384723:elastic-ip/* because no identity-based policy allows the ec2:AllocateAddress action. Encoded authorization failure message: d6K2sRfYyxejbTF9U3oYJIej2WY6WKNaLoP-YknJhh93koKd2PGCkAhS49zpH2F2cdADGajyw3YyK-YqmkGXEuemEoJtSunS9FBwyESQmskTSIwLwgs3vylCmfpqdmpvvHyUADPw6M5UtdGTxdDv9yH1dLgpwSyJWeRR57_FastZCCSAixhkAUxjS_NYvXMideXvOKpt3gICe3w3GX7JqQ2zKMnPnI-x37IbvSyNQtTBN9vkEwMgN1Snw02Tb-jPpg-eQ-HETNgouvIJlRP1KDwW4-_Wg_E9lbczhu-dwecH0pC6UajtZtrxfPsUuvBzYvn_0Nwc1uBKjzBF69NcVa9b1SCcRNSLMsQdBZr1NOvurPQ_fXJh_7MvGQphWxYWa4CD18-Uh2XZglJsX1b-sK1yFJ7q0BWagThUa81c3CDbwsBGr0cndZljx6XTkgmERcQJvRXIh2bjeB630P9JAxnpqfqeBzf57nQW-mm4rFtWbGSt0Z3Xh4Skf5z0JgFvUXR20G0R8uSDRknT7XxSCM_yjnAGN36kdCkRwwfhNW0JxU8
  
    with aws_eip.nat[0],
    on vpc.tf line 49, in resource "aws_eip" "nat":
    49: resource "aws_eip" "nat" {
  
  
  exit status 1


❯❯ Run Summary  3 units  21s
   ────────────────────────────
   Failed       1
   Early Exits  2

08:27:22.583 ERROR  3 errors occurred:

* Unit './env/dev/load-balancer' did not run due to a failure in './env/dev/vpc'

* Unit './env/dev/ec2' did not run due to a failure in './env/dev/vpc'

* Failed to execute "terraform1.14.3 apply -no-color -input=false -auto-approve" in ./env/dev/vpc/.terragrunt-cache/1Hzr5YObEtyI2lqsyupnu-0ozVA/5yKHsJOCfqHZaOBmSCc5tSLa6MM
  
  Error: creating EC2 VPC: operation error EC2: CreateVpc, https response error StatusCode: 403, RequestID: e792a1c0-d30d-42a1-8a90-bafed358d0ed, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995242251522954 is not authorized to perform: ec2:CreateVpc on resource: arn:aws:ec2:us-east-1:730335384723:vpc/* because no identity-based policy allows the ec2:CreateVpc action. Encoded authorization failure message: szSSngra2Ph_eu1tB_v3JeuO0cxa0SO2wKgHyDY9E7TmhPL2ci65via3HRex14MytovYWjIq3YMEtDsKEEpX8RfBVyEJ7BW3cLqF7ogHLkDfiVC3w8Cqs24pm74S50Ws3YYBVw_DUEduUnddFKXdkYzBChYl6Iy1VBuO97Yn1cLQaL8rtfjEeIUTCNa243WDL6CMHiulvrpIGo_zBwzdx92IaHWUQt_ilaP1uFatzkIJUrDdw3qEy9jWnnndzVokj1eTPzt0lBJVXlAXrxDcs_WFLIyprc9QQ_z6gOCexb5BZz2gZkFea2eYDSKcS6bjHJg6oBy3XBT_UW3YZZKrr85Td4l_CiNfZMGVTl3U5atrm5NHOdabuYIged6WMNbfpFyLfGMfKmRnsshQ23LC1n16COz8b1RKfpPort9r_Kaq1UrbLeaknbIXa02AsDk17C8xqN-Qb8yYK04GSXbyhFxzX0Eg35G1VQDwl61eVgcvc4HDRzE13iZTMg3eK7vxDyw3R08j8bJrMRYbjN2t_FboKoDCtln_nph40fpoH-91S18vxgOMPu4iMuKo9A
  
    with aws_vpc.main,
    on vpc.tf line 1, in resource "aws_vpc" "main":
     1: resource "aws_vpc" "main" {
  
  
  Error: creating EC2 EIP: operation error EC2: AllocateAddress, https response error StatusCode: 403, RequestID: 5e2e73b0-02bc-40f8-99ee-53166fe23c1f, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995242251522954 is not authorized to perform: ec2:AllocateAddress on resource: arn:aws:ec2:us-east-1:730335384723:elastic-ip/* because no identity-based policy allows the ec2:AllocateAddress action. Encoded authorization failure message: d6K2sRfYyxejbTF9U3oYJIej2WY6WKNaLoP-YknJhh93koKd2PGCkAhS49zpH2F2cdADGajyw3YyK-YqmkGXEuemEoJtSunS9FBwyESQmskTSIwLwgs3vylCmfpqdmpvvHyUADPw6M5UtdGTxdDv9yH1dLgpwSyJWeRR57_FastZCCSAixhkAUxjS_NYvXMideXvOKpt3gICe3w3GX7JqQ2zKMnPnI-x37IbvSyNQtTBN9vkEwMgN1Snw02Tb-jPpg-eQ-HETNgouvIJlRP1KDwW4-_Wg_E9lbczhu-dwecH0pC6UajtZtrxfPsUuvBzYvn_0Nwc1uBKjzBF69NcVa9b1SCcRNSLMsQdBZr1NOvurPQ_fXJh_7MvGQphWxYWa4CD18-Uh2XZglJsX1b-sK1yFJ7q0BWagThUa81c3CDbwsBGr0cndZljx6XTkgmERcQJvRXIh2bjeB630P9JAxnpqfqeBzf57nQW-mm4rFtWbGSt0Z3Xh4Skf5z0JgFvUXR20G0R8uSDRknT7XxSCM_yjnAGN36kdCkRwwfhNW0JxU8
  
    with aws_eip.nat[0],
    on vpc.tf line 49, in resource "aws_eip" "nat":
    49: resource "aws_eip" "nat" {
  
  
  exit status 1



```
</details>